import { TableSelectEmitInfo, Vars } from "@site0/tijs";
import { computed } from "vue";
import {
  BatchFormNameProps,
  BatchFormNameEmitter,
} from "./batch-form-name-types";

export type BatchFormNameApi = ReturnType<typeof useBatchFormNameApi>;

export function useBatchFormNameApi(
  _props: BatchFormNameProps,
  _emit: BatchFormNameEmitter
) {
  //-----------------------------------------------------
  // 数据模型
  //-----------------------------------------------------
  //-----------------------------------------------------
  // 计算属性
  //-----------------------------------------------------
  //-----------------------------------------------------
  // 操作函数
  //-----------------------------------------------------
  //-----------------------------------------------------
  // 数据改动
  //-----------------------------------------------------
  //-----------------------------------------------------
  // 远程操作
  //-----------------------------------------------------
  //-----------------------------------------------------
  // 返回接口
  //-----------------------------------------------------
  return {
    // 计算属性
    // 操作函数
    // 数据改动
    // 远程操作
  };
}
