<script lang="ts" setup></script>
<template>
  <div class="ti-main-frame mode-Z">
    <!--顶栏-->
    <div class="frame-part as-sky">Sky</div>
    <!--主区域-->
    <div class="frame-part as-arena">
      <div class="arena-con">
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
        <p>非常多的内容</p>
      </div>
    </div>
    <!--侧边栏-->
    <div class="frame-part as-chute">Chute</div>
    <!--底栏-->
    <div class="frame-part as-foot">Foot</div>
  </div>
</template>
<style lang="scss" scoped>
  @use '../../../assets/style/_all.scss' as *;
  @import './ti-main-frame.scss';
</style>
