import {
  DataValidation,
  FieldStatus,
  KeepInfo,
  TableSelectEmitInfo,
  useValidateResults,
  V,
  ValidateOptions,
  Vars,
} from "@site0/tijs";
import _ from "lodash";
import { computed } from "vue";
import { TiInputBox3Props, TiInputBox3Emitter } from "./ti-input-box3-types";

export type TiInputBox3Api = ReturnType<typeof useTiInputBox3Api>;
export type TiInputBox3Setup = {
  emit: TiInputBox3Emitter,
  getValidation?: () => DataValidation | undefined,
}

export function useTiInputBox3Api(
  _props: TiInputBox3Props, 
  _setup: TiInputBox3Setup
) {
  //-----------------------------------------------------
  // 数据模型
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  // 计算属性
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  // 操作函数
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  // 数据校验
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  // 数据改动
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  // 远程操作
  //-----------------------------------------------------
  
  //-----------------------------------------------------
  // 返回接口
  //-----------------------------------------------------
  return {
    // 计算属性
    
    // 操作函数
    
    // 数据校验
    
    // 数据改动
    
    // 远程操作
    
  };
}